[
    {
        "name": "BLT Sandwich",
        "photoURL": "https://sophnstuff.files.wordpress.com/2013/03/dsc_0143-copy.jpg",
        "shortDescription": "A savory Bacon, Lettuce, and Tomato Sandwich",
        "longDescription": "This is a bacon, lettuce, and tomato sandwich crafted by the one and only Martha Stewart. This recipe uses high quality, locally sources ingredients for the freshest possible taste a person can get. Pairs great with a side of french fries and a cold glass of milk.",
        "ingredients": ["Bread","Butter","Lettuce","Tomato","Basil","Bacon","Mayonnaise","Pepper"],
        "instructions": ["Spread one side of one slice of toast with butter","Arrange lettuce on top, along with tomato and basil. Season with salt and pepper","Top with bacon","Spread remaining slice of toast with mayonnaise","Place mayonnaise side down to form a sandwich and cut on the diagonal","Serve immediately"],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Short",
        "difficulty": "Easy",
        "vegetarian": "false",
        "vegan": "false",
        "id": "0"
    },
    {
        "name": "Macaroni and Cheese",
        "photoURL": "https://www.seriouseats.com/images/2016/11/20161028-baked-macaroni-cheese-sodium-citrate-vicky-wasik-20.jpg",
        "shortDescription": "A delicious macaroni and cheese recipe made by Alton Brown",
        "longDescription": "This is a wonderful baked macaroni and cheese recipe that will make anyone you feed it to fell like they are eating a reastaurant quality meal",
        "ingredients": ["Macaroni", "Butter", "Flour", "Mustard", "Milk", "Onion", "Paprika", "egg", "Cheese", "Salt", "Pepper"],
        "instructions": ["Preheat oven to 350 degrees F", "In a large pot of boiling, salted water cook the pasta to al dente", "While the pasta is cooking, in a separate pot, melt the butter. Whisk in the flour and mustard and keep it moving for about five minutes. Make sure it's free of lumps. Stir in the milk, onion, bay leaf, and paprika. Simmer for ten minutes and remove the bay leaf", "Temper in the egg. Stir in 3/4 of the cheese. Season with salt and pepper. Fold the macaroni into the mix and pour into a 2-quart casserole dish. Top with remaining cheese", "Melt the butter in a saute pan and toss the bread crumbs to coat. Top the macaroni with the bread crumbs. Bake for 30 minutes. Remove from oven and rest for five minutes before serving", "Remember to save leftovers for fried Macaroni and Cheese"],
        "comments": ["comment 1", "comment 2", "comment 3", "comment 4"],
        "rating": "",
        "percent": "",
        "time": "Medium",
        "difficulty": "Moderate",
        "vegetarian": "true",
        "vegan": "false",
        "id": "1"
    },
    {
        "name": "Clam Chowder",
        "photoURL": "https://cdn-image.foodandwine.com/sites/default/files/styles/4_3_horizontal_-_1200x900/public/panhandle-clam-chowder-xl-r-200002.jpg?itok=-q1p9_fm",
        "shortDescription": "A Large Portion of Clam Chowder",
        "longDescription": "A delicious clam chowder recipe that will serve enough for a amll gathering. Make this when your parents are in town",
        "ingredients": ["Clams","Butter","Celery","Onion","Salt","Pepper","Flour","Bacon","Potatoes","Scallions","Milk","Cream","Parsley"],
        "instructions": ["First, shuck the clams and remove the bellies. Clean the clams and then chop them into small pieces. Put to the side until ready to add to the po","Heat the butter in a stockpot over medium-high heat. Add the celery and sweet onion and cook, mixing often, until they begin to soften. Next, sprinkle in the salt, black pepper and seafood boil seasoning. Add the self-rising flour to make a roux. Reduce the heat to medium-low. Stir in the clams and clam juice","Meanwhile, cook the bacon and finely chop. Add to the pot. Add the potatoes along with the scallions. Stir to combine. Lastly, add the milk and half-and-half. Stir to warm. Serve in a bowl with parsley as a garnish"],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Medium",
        "difficulty": "Meduim",
        "vegetarian": "false",
        "vegan": "false",
        "id": "2"
    }
]
