[
    {
        "name": "BLT Sandwich",
        "photoURL": "https://sophnstuff.files.wordpress.com/2013/03/dsc_0143-copy.jpg",
        "shortDescription": "A savory Bacon, Lettuce, and Tomato Sandwich",
        "longDescription": "This is a bacon, lettuce, and tomato sandwich crafted by the one and only Martha Stewart. This recipe uses high quality, locally sources ingredients for the freshest possible taste a person can get. Pairs great with a side of french fries and a cold glass of milk.",
        "ingredients": ["Bread","Butter","Lettuce","Tomato","Basil","Bacon","Mayonnaise","Pepper"],
        "instructions": ["Spread one side of one slice of toast with butter","Arrange lettuce on top, along with tomato and basil. Season with salt and pepper","Top with bacon","Spread remaining slice of toast with mayonnaise","Place mayonnaise side down to form a sandwich and cut on the diagonal","Serve immediately"],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Short",
        "difficulty": "Easy",
        "vegetarian": "false",
        "vegan": "false",
        "id": "0"
    },
    {
        "name": "Macaroni and Cheese",
        "photoURL": "https://www.seriouseats.com/images/2016/11/20161028-baked-macaroni-cheese-sodium-citrate-vicky-wasik-20.jpg",
        "shortDescription": "A delicious macaroni and cheese recipe made by Alton Brown",
        "longDescription": "This is a wonderful baked macaroni and cheese recipe that will make anyone you feed it to fell like they are eating a reastaurant quality meal",
        "ingredients": ["Macaroni", "Butter", "Flour", "Mustard", "Milk", "Onion", "Paprika", "Egg", "Cheese", "Salt", "Pepper"],
        "instructions": ["Preheat oven to 350 degrees F", "In a large pot of boiling, salted water cook the pasta to al dente", "While the pasta is cooking, in a separate pot, melt the butter. Whisk in the flour and mustard and keep it moving for about five minutes. Make sure it's free of lumps. Stir in the milk, onion, bay leaf, and paprika. Simmer for ten minutes and remove the bay leaf", "Temper in the egg. Stir in 3/4 of the cheese. Season with salt and pepper. Fold the macaroni into the mix and pour into a 2-quart casserole dish. Top with remaining cheese", "Melt the butter in a saute pan and toss the bread crumbs to coat. Top the macaroni with the bread crumbs. Bake for 30 minutes. Remove from oven and rest for five minutes before serving", "Remember to save leftovers for fried Macaroni and Cheese"],
        "comments": ["comment 1", "comment 2", "comment 3", "comment 4"],
        "rating": "",
        "percent": "",
        "time": "Medium",
        "difficulty": "Moderate",
        "vegetarian": "true",
        "vegan": "false",
        "id": "1"
    },
    {
        "name": "Clam Chowder",
        "photoURL": "https://cdn-image.foodandwine.com/sites/default/files/styles/4_3_horizontal_-_1200x900/public/panhandle-clam-chowder-xl-r-200002.jpg?itok=-q1p9_fm",
        "shortDescription": "A Large Portion of Clam Chowder",
        "longDescription": "A delicious clam chowder recipe that will serve enough for a amll gathering. Make this when your parents are in town",
        "ingredients": ["Clams","Butter","Celery","Onion","Salt","Pepper","Flour","Bacon","Potatoes","Scallions","Milk","Cream","Parsley"],
        "instructions": ["First, shuck the clams and remove the bellies. Clean the clams and then chop them into small pieces. Put to the side until ready to add to the pot","Heat the butter in a stockpot over medium-high heat. Add the celery and sweet onion and cook, mixing often, until they begin to soften. Next, sprinkle in the salt, black pepper and seafood boil seasoning. Add the self-rising flour to make a roux. Reduce the heat to medium-low. Stir in the clams and clam juice","Meanwhile, cook the bacon and finely chop. Add to the pot. Add the potatoes along with the scallions. Stir to combine. Lastly, add the milk and half-and-half. Stir to warm. Serve in a bowl with parsley as a garnish"],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Medium",
        "difficulty": "Moderate",
        "vegetarian": "false",
        "vegan": "false",
        "id": "2"
    },
    {
        "name": "Pan-Seared Strip Steak",
        "photoURL": "https://omahasteakblog.wpengine.com/wp-content/uploads/2014/09/Grilling-Flat-Irons-BP.jpg",
        "shortDescription": "A Juicy Portion of Steak That Will Leave you Wanting More",
        "longDescription": "This fantastic strip steak is the perfect dinner for date night or any special occasion that deserves something extra delicious on the table. A little butter adds richness and keeps the leaner-than-usual beef moist without adding much in the way of total fat. Don't know how to cook steak on the stove? No worries! Not only is this one of our best steak recipes, it's incredibly easy. However, a word of caution: This recipe is smoky! Keep your exhaust fan on high or cook in a skillet on a hot outdoor grill.",
        "ingredients": ["Steak","Salt","Pepper","Oil","Butter","Thyme","Garlic"],
        "instructions": ["Let steaks stand 30 minutes at room temperature.","Sprinkle salt and pepper evenly over steaks. Heat a large cast-iron skillet over high heat. Add oil to pan; swirl to coat. Add steaks to pan; cook 3 minutes on each side or until browned. Reduce heat to medium-low; add butter, thyme, and garlic to pan. Carefully grasp pan handle using an oven mitt or folded dish towel. Tilt pan toward you so butter pools; cook 1 1/2 minutes, basting steaks with butter constantly. Remove steaks from pan; cover loosely with foil. Let stand 10 minutes. Reserve butter mixture.","Cut steak diagonally across grain into thin slices. Discard thyme and garlic; spoon reserved butter mixture over steak."],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Long",
        "difficulty": "Hard",
        "vegetarian": "false",
        "vegan": "false",
        "id": "3"
    },
    {
        "name": "Spanish Omelet",
        "photoURL": "https://www.seriouseats.com/recipes/images/2016/04/20160418-american-omelet-ham-and-cheese-21-1500x1125.jpg",
        "shortDescription": "A Wonderful Morning Breakfast that will get your Day Started Right",
        "longDescription": "This wonderful omelet recipe combines all of te best ingredients to make your first meal of the day an amazing experience that will inspire you throughout your day and keep you energized until you crave it again",
        "ingredients": ["Potato","Oil","Onion","Salt","Pepper","Egg","Rosemary"],
        "instructions": ["Heat oven to 350° F.","Heat the oil in an ovenproof, preferably nonstick, skillet over medium heat. Add the potatoes and cook until almost tender, about 10 minutes. Add the onion and cook until softened, about 5 minutes. Carefully pour off all but 1 tablespoon of the oil from the potatoes and onion. Season with 1 teaspoon of the salt and the pepper.","Meanwhile, in a medium bowl, combine the eggs, the rosemary (if using), and the remaining salt. Pour the eggs over the potatoes and reduce heat to low. Cook, without stirring, for 1 minute. Stir once and cook until the eggs begin to set, about 3 minutes. Transfer to oven and bake until set, about 8 minutes. Use a knife to loosen the omelet from the side of the skillet. Slide or invert it onto a plate. Slice into wedges. Serve hot or at room temperature."],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Short",
        "difficulty": "Easy",
        "vegetarian": "false",
        "vegan": "false",
        "id": "4"
    },
    {
        "name": "Chicago Hot Dog",
        "photoURL": "https://i1.wp.com/urbanmatter.com/chicago/wp-content/uploads/2018/04/shutterstock_150836243.jpg?fit=1000%2C667&ssl=1",
        "shortDescription": "A Hot Dog Straight Out of Chicago",
        "longDescription": "A wonderful recipe for a Chicago-inspired hot dog that will make you feel like you are at a baseball game",
        "ingredients": ["Weiner","Tomato","Cucumber","Bun","Onion","Relish","Mustard"],
        "instructions": ["Preheat grill to medium heat. Place 4 (97% fat-free) beef franks on grill rack coated with cooking spray; grill, covered, 10 to 15 minutes, turning frequently until done. Place 3 strips tomato, 1 thin slice cucumber, and 1 frank in each of 4 toasted white-wheat hot dog buns. Top each frank with about 2 tablespoons diced white onion, about 1/2 tablespoon sweet pickle relish, and about 2 teaspoons mustard."],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Short",
        "difficulty": "Easy",
        "vegetarian": "false",
        "vegan": "false",
        "id": "5"
    },
    {
        "name": "Shrimp Tacos",
        "photoURL": "https://images-gmi-pmc.edge-generalmills.com/d984e059-801b-4f3e-ba65-0c501e95413f.jpg",
        "shortDescription": "Wonderful Shrimp Tacos",
        "longDescription": "These Shrimp Tacos are big on flavor thanks to the shrimp marinade and and slaw that carries a little kick.",
        "ingredients": ["Sugar","Chili","Cumin","Garlic","Onion","Oregano","Salt","Lime","Oil","Shrimp","Mayonnaise","Cream","Brocolli","Cilantro","Tortilla"],
        "instructions": ["Make filling: In a large bowl, thoroughly combine all filling ingredients, except shrimp. Add shrimp and toss to coat. Cover and refrigerate for 30 minutes.","Make slaw: In a large bowl, whisk mayonnaise, sour cream, lime juice, chile and adobo sauce. Add broccoli slaw mix, onion and cilantro. Mix well. Season with salt. Cover and refrigerate.","Preheat oven to 300ºF. Wrap tortillas in foil and bake for 10 minutes to soften.","Place a skillet large enough to hold shrimp in a single layer over medium heat. Cook shrimp until just opaque and cooked through, 3 to 5 minutes, turning once.","Divide shrimp among tortillas, top with slaw and 1 Tbsp. salsa."],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Short",
        "difficulty": "Hard",
        "vegetarian": "false",
        "vegan": "false",
        "id": "6"
    },
    {
        "name": "Artichoke and Mushroom Salad",
        "photoURL": "https://cdn-image.myrecipes.com/sites/default/files/image/recipes/ay/13/08/artichoke-mushroom-salad-ay-x.jpg",
        "shortDescription": "A Fresh Vegetarian Salad",
        "longDescription": "A wonderfully fresh salad that provides all nutrients needed to take on the day. Vegetarian of Course",
        "ingredients": ["Vinegar","Mustard","Oil","Butter","Mushrooms","Wine","Artichoke","Olives","Pepper","Spinach","Tomato","Cheese"],
        "instructions": ["In a small bowl, whisk vinegar and Dijon. Slowly whisk in 3 Tbsp. olive oil.","Melt butter with remaining 1 Tbsp. oil in a skillet over medium heat. Add mushrooms and cook, stirring, until they release their liquid, about 4 minutes. Add herbs and port; cook until wine evaporates, stirring occasionally.","Add artichokes and olives to skillet. Cook, stirring, until warm, 1 to 2 minutes. Remove pan from heat and season with salt and pepper.","In a large bowl, toss spinach with vinaigrette and divide among plates. Spoon artichoke mixture on top; sprinkle with tomatoes and cheese."],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Short",
        "difficulty": "Easy",
        "vegetarian": "true",
        "vegan": "true",
        "id": "7"
    },
    {
        "name": "Chunky Beef Chili",
        "photoURL": "http://www.simplyrecipes.com/wp-content/uploads/2005/11/turkey-chili-horiz-a-1600.jpg",
        "shortDescription": "A Warm Chili for a Cold Day",
        "longDescription": "This hearty beef chili features boneless chuck roast and a medley of traditional chili seasonings. Serve with homemade cornbread for a complete meal.",
        "ingredients": ["Chuck","Chili","Tomato","Broth","Garlic","Salt","Oregano","Cumin","Paprika","Onion","Pepper","Cornbread"],
        "instructions": ["Brown meat, in batches, in a Dutch oven over medium-high heat. Remove meat, reserving drippings in Dutch oven. Add chili powder to Dutch oven; cook, stirring constantly, 2 minutes. Stir in tomato paste; cook 5 minutes.","Return beef to Dutch oven. Stir in beef broth and next 9 ingredients; bring to a boil. Reduce heat to low, and simmer, uncovered, stirring occasionally, 1 1/2 hours or until beef is tender. Serve with cornbread sticks, if desired, and desired toppings."],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Long",
        "difficulty": "Hard",
        "vegetarian": "false",
        "vegan": "false",
        "id": "8"
    },
    {
        "name": "Braised Short Ribs",
        "photoURL": "https://iheartrecipes.com/wp-content/uploads/2014/06/IMG_4759.jpg",
        "shortDescription": "Amazing Ribs for a Special Ocassion",
        "longDescription": "These braised beef short ribs get their incredible flavor from a flavorful, spiced wine marinade.  The marinade reduces to a savory sauce that's perfect drizzled over a side of roasted potatoes.",
        "ingredients": ["Wine","Broth","Garlic","Allspice","Ginger","Ribs","Salt","Pepper","Flour","Oil","Carrot","Onion","Celery","Tomato","Parsley"],
        "instructions": ["Combine 1/4 cup wine, 1/4 cup broth, garlic, allspice, and ginger in a shallow dish; add ribs, turning to coat. Cover and chill ribs for 4 to 6 hours, turning occasionally.","Remove ribs from marinade, reserving marinade. Sprinkle ribs with salt and pepper; dredge in flour.","Cook ribs, in batches, in hot oil in a Dutch oven over medium-high heat 15 minutes or until browned. Remove ribs, and set aside.","Reduce heat to medium; add carrot, onion, and celery, and sauté 7 minutes or until browned. Add tomato paste; cook, stirring constantly, 3 minutes.","Return ribs to pan. Stir in reserved marinade and remaining 2 cups wine and 2 cups broth; bring mixture to a boil, and tightly cover.","Bake at 300° for 3 hours. Remove ribs.","Skim fat from sauce and discard; simmer sauce for 12 to 15 minutes or until reduced by half. Serve with ribs over roasted potatoes. Garnish, if desired"],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Long",
        "difficulty": "Hard",
        "vegetarian": "false",
        "vegan": "false",
        "id": "9"
    }
]
