[
    {
        "name": "BLT Sandwich",
        "photoURL": "https://sophnstuff.files.wordpress.com/2013/03/dsc_0143-copy.jpg",
        "shortDescription": "A savory Bacon, Lettuce, and Tomato Sandwich",
        "longDescription": "This is a bacon, lettuce, and tomato sandwich crafted by the one and only Martha Stewart. This recipe uses high quality, locally sources ingredients for the freshest possible taste a person can get. Pairs great with a side of french fries and a cold glass of milk.",
        "ingredients": ["Bread","Butter","Lettuce","Tomato","Basil","Bacon","Mayonnaise","Pepper"],
        "instructions": ["Spread one side of one slice of toast with butter","Arrange lettuce on top, along with tomato and basil. Season with salt and pepper","Top with bacon","Spread remaining slice of toast with mayonnaise","Place mayonnaise side down to form a sandwich and cut on the diagonal","Serve immediately"],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Short",
        "difficulty": "Easy",
        "vegetarian": "false",
        "vegan": "false",
        "id": "0"
    },
    {
        "name": "Macaroni and Cheese",
        "photoURL": "https://www.seriouseats.com/images/2016/11/20161028-baked-macaroni-cheese-sodium-citrate-vicky-wasik-20.jpg",
        "shortDescription": "A delicious macaroni and cheese recipe made by Alton Brown",
        "longDescription": "This is a wonderful baked macaroni and cheese recipe that will make anyone you feed it to fell like they are eating a reastaurant quality meal",
        "ingredients": ["Macaroni", "Butter", "Flour", "Mustard", "Milk", "Onion", "Paprika", "Egg", "Cheese", "Salt", "Pepper"],
        "instructions": ["Preheat oven to 350 degrees F", "In a large pot of boiling, salted water cook the pasta to al dente", "While the pasta is cooking, in a separate pot, melt the butter. Whisk in the flour and mustard and keep it moving for about five minutes. Make sure it's free of lumps. Stir in the milk, onion, bay leaf, and paprika. Simmer for ten minutes and remove the bay leaf", "Temper in the egg. Stir in 3/4 of the cheese. Season with salt and pepper. Fold the macaroni into the mix and pour into a 2-quart casserole dish. Top with remaining cheese", "Melt the butter in a saute pan and toss the bread crumbs to coat. Top the macaroni with the bread crumbs. Bake for 30 minutes. Remove from oven and rest for five minutes before serving", "Remember to save leftovers for fried Macaroni and Cheese"],
        "comments": ["comment 1", "comment 2", "comment 3", "comment 4"],
        "rating": "",
        "percent": "",
        "time": "Medium",
        "difficulty": "Moderate",
        "vegetarian": "true",
        "vegan": "false",
        "id": "1"
    },
    {
        "name": "Clam Chowder",
        "photoURL": "https://cdn-image.foodandwine.com/sites/default/files/styles/4_3_horizontal_-_1200x900/public/panhandle-clam-chowder-xl-r-200002.jpg?itok=-q1p9_fm",
        "shortDescription": "A Large Portion of Clam Chowder",
        "longDescription": "A delicious clam chowder recipe that will serve enough for a amll gathering. Make this when your parents are in town",
        "ingredients": ["Clams","Butter","Celery","Onion","Salt","Pepper","Flour","Bacon","Potatoes","Scallions","Milk","Cream","Parsley"],
        "instructions": ["First, shuck the clams and remove the bellies. Clean the clams and then chop them into small pieces. Put to the side until ready to add to the pot","Heat the butter in a stockpot over medium-high heat. Add the celery and sweet onion and cook, mixing often, until they begin to soften. Next, sprinkle in the salt, black pepper and seafood boil seasoning. Add the self-rising flour to make a roux. Reduce the heat to medium-low. Stir in the clams and clam juice","Meanwhile, cook the bacon and finely chop. Add to the pot. Add the potatoes along with the scallions. Stir to combine. Lastly, add the milk and half-and-half. Stir to warm. Serve in a bowl with parsley as a garnish"],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Medium",
        "difficulty": "Meduim",
        "vegetarian": "false",
        "vegan": "false",
        "id": "2"
    },
    {
        "name": "Pan-Seared Strip Steak",
        "photoURL": "https://omahasteakblog.wpengine.com/wp-content/uploads/2014/09/Grilling-Flat-Irons-BP.jpg",
        "shortDescription": "A Juicy Portion of Steak That Will Leave you Wanting More",
        "longDescription": "This fantastic strip steak is the perfect dinner for date night or any special occasion that deserves something extra delicious on the table. A little butter adds richness and keeps the leaner-than-usual beef moist without adding much in the way of total fat. Don't know how to cook steak on the stove? No worries! Not only is this one of our best steak recipes, it's incredibly easy. However, a word of caution: This recipe is smoky! Keep your exhaust fan on high or cook in a skillet on a hot outdoor grill.",
        "ingredients": ["Steak","Salt","Pepper","Oil","Butter","Thyme","Garlic"],
        "instructions": ["Let steaks stand 30 minutes at room temperature.","Sprinkle salt and pepper evenly over steaks. Heat a large cast-iron skillet over high heat. Add oil to pan; swirl to coat. Add steaks to pan; cook 3 minutes on each side or until browned. Reduce heat to medium-low; add butter, thyme, and garlic to pan. Carefully grasp pan handle using an oven mitt or folded dish towel. Tilt pan toward you so butter pools; cook 1 1/2 minutes, basting steaks with butter constantly. Remove steaks from pan; cover loosely with foil. Let stand 10 minutes. Reserve butter mixture.","Cut steak diagonally across grain into thin slices. Discard thyme and garlic; spoon reserved butter mixture over steak."],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Medium",
        "difficulty": "Hard",
        "vegetarian": "false",
        "vegan": "false",
        "id": "3"
    },
    {
        "name": "Spanish Omelet",
        "photoURL": "https://www.seriouseats.com/recipes/images/2016/04/20160418-american-omelet-ham-and-cheese-21-1500x1125.jpg",
        "shortDescription": "A Wonderful Morning Breakfast that will get your Day Started Right",
        "longDescription": "This wonderful omelet recipe combines all of te best ingredients to make your first meal of the day an amazing experience that will inspire you throughout your day and keep you energized until you crave it again",
        "ingredients": ["Potato","Oil","Onion","Salt","Pepper","Egg","Rosemary"],
        "instructions": ["Heat oven to 350° F.","Heat the oil in an ovenproof, preferably nonstick, skillet over medium heat. Add the potatoes and cook until almost tender, about 10 minutes. Add the onion and cook until softened, about 5 minutes. Carefully pour off all but 1 tablespoon of the oil from the potatoes and onion. Season with 1 teaspoon of the salt and the pepper.","Meanwhile, in a medium bowl, combine the eggs, the rosemary (if using), and the remaining salt. Pour the eggs over the potatoes and reduce heat to low. Cook, without stirring, for 1 minute. Stir once and cook until the eggs begin to set, about 3 minutes. Transfer to oven and bake until set, about 8 minutes. Use a knife to loosen the omelet from the side of the skillet. Slide or invert it onto a plate. Slice into wedges. Serve hot or at room temperature."],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Short",
        "difficulty": "Easy",
        "vegetarian": "false",
        "vegan": "false",
        "id": "4"
    },
    {
        "name": "Chicago Hot Dog",
        "photoURL": "https://i1.wp.com/urbanmatter.com/chicago/wp-content/uploads/2018/04/shutterstock_150836243.jpg?fit=1000%2C667&ssl=1",
        "shortDescription": "A hot Dog Straight Out of Chicago",
        "longDescription": "A wonderful recipe for a Chicago-inspired hot dog that will make you feel like you are at a baseball game",
        "ingredients": ["Weiner","Tomato","Cucumber","Bun","Onion","Relish","Mustard"],
        "instructions": [""],
        "comments": ["comment 1","comment 2","comment 3","comment 4"],
        "rating": "",
        "percent": "",
        "time": "Short",
        "difficulty": "Easy",
        "vegetarian": "false",
        "vegan": "false",
        "id": "5"
    }
]
